modm-ext/data.modm.io/docs/svd/header_stm32h503xx.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>GTZC_MPCBB1</name>
      <groupName>GTZC_MPCBB</groupName>
      <baseAddress>0x40032c00</baseAddress>
      <registers>
        <register>
          <name>PRIVCFGR0</name>
          <description>MPCBBx privilege configuration registers</description>
          <addressOffset>0x200</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>PRIVCFGR1</name>
          <description>MPCBBx privilege configuration registers</description>
          <addressOffset>0x204</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>PRIVCFGR2</name>
          <description>MPCBBx privilege configuration registers</description>
          <addressOffset>0x208</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>PRIVCFGR3</name>
          <description>MPCBBx privilege configuration registers</description>
          <addressOffset>0x20c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>PRIVCFGR4</name>
          <description>MPCBBx privilege configuration registers</description>
          <addressOffset>0x210</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>PRIVCFGR5</name>
          <description>MPCBBx privilege configuration registers</description>
          <addressOffset>0x214</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>PRIVCFGR6</name>
          <description>MPCBBx privilege configuration registers</description>
          <addressOffset>0x218</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>PRIVCFGR7</name>
          <description>MPCBBx privilege configuration registers</description>
          <addressOffset>0x21c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>PRIVCFGR8</name>
          <description>MPCBBx privilege configuration registers</description>
          <addressOffset>0x220</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>PRIVCFGR9</name>
          <description>MPCBBx privilege configuration registers</description>
          <addressOffset>0x224</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>PRIVCFGR10</name>
          <description>MPCBBx privilege configuration registers</description>
          <addressOffset>0x228</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>PRIVCFGR11</name>
          <description>MPCBBx privilege configuration registers</description>
          <addressOffset>0x22c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>PRIVCFGR12</name>
          <description>MPCBBx privilege configuration registers</description>
          <addressOffset>0x230</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>PRIVCFGR13</name>
          <description>MPCBBx privilege configuration registers</description>
          <addressOffset>0x234</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>PRIVCFGR14</name>
          <description>MPCBBx privilege configuration registers</description>
          <addressOffset>0x238</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>PRIVCFGR15</name>
          <description>MPCBBx privilege configuration registers</description>
          <addressOffset>0x23c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>PRIVCFGR16</name>
          <description>MPCBBx privilege configuration registers</description>
          <addressOffset>0x240</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>PRIVCFGR17</name>
          <description>MPCBBx privilege configuration registers</description>
          <addressOffset>0x244</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>PRIVCFGR18</name>
          <description>MPCBBx privilege configuration registers</description>
          <addressOffset>0x248</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>PRIVCFGR19</name>
          <description>MPCBBx privilege configuration registers</description>
          <addressOffset>0x24c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>PRIVCFGR20</name>
          <description>MPCBBx privilege configuration registers</description>
          <addressOffset>0x250</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>PRIVCFGR21</name>
          <description>MPCBBx privilege configuration registers</description>
          <addressOffset>0x254</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>PRIVCFGR22</name>
          <description>MPCBBx privilege configuration registers</description>
          <addressOffset>0x258</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>PRIVCFGR23</name>
          <description>MPCBBx privilege configuration registers</description>
          <addressOffset>0x25c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>PRIVCFGR24</name>
          <description>MPCBBx privilege configuration registers</description>
          <addressOffset>0x260</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>PRIVCFGR25</name>
          <description>MPCBBx privilege configuration registers</description>
          <addressOffset>0x264</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>PRIVCFGR26</name>
          <description>MPCBBx privilege configuration registers</description>
          <addressOffset>0x268</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>PRIVCFGR27</name>
          <description>MPCBBx privilege configuration registers</description>
          <addressOffset>0x26c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>PRIVCFGR28</name>
          <description>MPCBBx privilege configuration registers</description>
          <addressOffset>0x270</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>PRIVCFGR29</name>
          <description>MPCBBx privilege configuration registers</description>
          <addressOffset>0x274</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>PRIVCFGR30</name>
          <description>MPCBBx privilege configuration registers</description>
          <addressOffset>0x278</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>PRIVCFGR31</name>
          <description>MPCBBx privilege configuration registers</description>
          <addressOffset>0x27c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
