modm-ext/data.modm.io/docs/svd/header_stm32h503xx.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>SBS</name>
      <description>System configuration, Boot and Security</description>
      <groupName>SBS</groupName>
      <baseAddress>0x44000400</baseAddress>
      <registers>
        <register>
          <name>HDPLCR</name>
          <description>SBS HDPL Control Register</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>INCR_HDPL</name>
              <description>Increment HDPL value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HDPLSR</name>
          <description>SBS HDPL Status Register</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>HDPL</name>
              <description>HDPL value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DBGCR</name>
          <description>SBS Debug Control Register</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>AP_UNLOCK</name>
              <description>Open the Access Port</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>DBG_UNLOCK</name>
              <description>Open the debug when DBG_AUTH_HDPL is reached</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>DBG_AUTH_HDPL</name>
              <description>HDPL value when the debug should be effectively opened</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DBGLOCKR</name>
          <description>SBS Debug Lock Register</description>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>DBGCFG_LOCK</name>
              <description>SBS_DBGLOCKR_DBGCFG_LOCK value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PMCR</name>
          <description>SBS Product Mode &amp; Config Register</description>
          <addressOffset>0x100</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PB6_FMP</name>
              <description>Fast-mode Plus command on PB(6)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PB7_FMP</name>
              <description>Fast-mode Plus command on PB(7)</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PB8_FMP</name>
              <description>Fast-mode Plus command on PB(8)</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FPUIMR</name>
          <description>SBS FPU Interrupt Mask Register</description>
          <addressOffset>0x104</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>FPU_IE</name>
              <description>All FPU interrupts enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MESR</name>
          <description>SBS Memory Erase Status Register</description>
          <addressOffset>0x108</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>MCLR</name>
              <description>Status of Erase after Reset</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IPMEE</name>
              <description>Status of End of Erase for ICache and PKA RAMs</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CCCSR</name>
          <description>SBS Compensation Cell Control &amp; Status Register</description>
          <addressOffset>0x110</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>EN1</name>
              <description>Enable compensation cell for VDD power rail</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CS1</name>
              <description>Code selection for VDD power rail</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EN2</name>
              <description>Enable compensation cell for VDDIO power rail</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CS2</name>
              <description>Code selection for VDDIO power rail</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RDY1</name>
              <description>VDD compensation cell ready flag</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RDY2</name>
              <description>VDDIO compensation cell ready flag</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CCVALR</name>
          <description>SBS Compensation Cell Value Register</description>
          <addressOffset>0x114</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ANSRC1</name>
              <description>NMOS compensation value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>APSRC1</name>
              <description>PMOS compensation value</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>ANSRC2</name>
              <description>NMOS compensation value</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>APSRC2</name>
              <description>PMOS compensation value</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CCSWCR</name>
          <description>SBS Compensation Cell for I/Os sw code Register</description>
          <addressOffset>0x118</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SW_ANSRC1</name>
              <description>NMOS compensation code for VDD Power Rail</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>SW_APSRC1</name>
              <description>PMOS compensation code for VDD Power Rail</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>SW_ANSRC2</name>
              <description>NMOS compensation code for VDDIO Power Rail</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>SW_APSRC2</name>
              <description>PMOS compensation code for VDDIO Power Rail</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFGR2</name>
          <description>SBS Class B Register</description>
          <addressOffset>0x120</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CLL</name>
              <description>Core Lockup Lock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SEL</name>
              <description>SRAM ECC Lock</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PVDL</name>
              <description>PVD Lock</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ECCL</name>
              <description>Flash ECC Lock</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CNSLCKR</name>
          <description>SBS CPU Non-secure Lock Register</description>
          <addressOffset>0x144</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>LOCKNSVTOR</name>
              <description>Disable VTOR_NS register writes by SW or debug agent</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LOCKNSMPU</name>
              <description>Disable Non-Secure MPU registers writes by SW or debug agent</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ECCNMIR</name>
          <description>SBS FLITF ECC NMI MASK Register</description>
          <addressOffset>0x14c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ECCNMI_MASK_EN</name>
              <description>Disable NMI in case of double ECC error in flash interface</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
